framework/storage/xml/edocument/consulta.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dig="http://www.ventanillaunica.gob.mx/aga/digitalizar/ws/oxml/DigitalizarDocumento" xmlns:res="http://www.ventanillaunica.gob.mx/common/ws/oxml/respuesta">
    <soapenv:Header>
	    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
		    <wsse:UsernameToken>
                <wsse:Username/>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/>
		    </wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
	    <dig:consultaDigitalizarDocumentoServiceRequest>
		    <dig:numeroOperacion/>
		    <dig:peticionBase>
		        <res:firmaElectronica>
		            <res:certificado/>
		            <res:cadenaOriginal/>
		            <res:firma/>
		        </res:firmaElectronica>
		    </dig:peticionBase>
		</dig:consultaDigitalizarDocumentoServiceRequest>
	</soapenv:Body>
</soapenv:Envelope>
		