framework/storage/xml/edocument/digitalizacion.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dig="http://www.ventanillaunica.gob.mx/aga/digitalizar/ws/oxml/DigitalizarDocumento" xmlns:res="http://www.ventanillaunica.gob.mx/common/ws/oxml/respuesta">
    <soapenv:Header>
	    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" >
		    <wsse:UsernameToken>
		        <wsse:Username/> 
		        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/> 
		    </wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
	    <dig:registroDigitalizarDocumentoServiceRequest>
            <dig:correoElectronico/>
            <dig:documento>
                <dig:idTipoDocumento/>
                <dig:nombreDocumento/>
                <dig:rfcConsulta/>
                <dig:archivo/>
            </dig:documento>
            <dig:peticionBase>
                <res:firmaElectronica>
                    <res:certificado/>
                    <res:cadenaOriginal/>
                    <res:firma/>
                </res:firmaElectronica>
            </dig:peticionBase>
	    </dig:registroDigitalizarDocumentoServiceRequest>
	</soapenv:Body>
</soapenv:Envelope>
        